/*
 *****************************************************************************************
 *	文 件 名 称:lcd1602.c
 *  创 建 平 台：Keil uVision4
 *	创 建 作 者：miki
 *  文 件 功 能：LCD1602显示屏配置
 *  github 地 址：
 *	创 建 日 期：2017-11-27
 *****************************************************************************************
 */

/************************************* 包含头文件 ***************************************/
#include "lcd1602.h"
#include "delay.h"

/************************************* 全局变量定义 **************************************/
u8 code tab1[]={"2014-  -   THU"};
u8 code tab2[]={"  :  :  "};

/*************************************** IO口定义 ****************************************/
sbit wr=P3^6;
sbit rs=P3^5;
sbit en=P3^4;

/********************************** 扩展全局变量定义 ************************************/


/************************************ 局部函数定义 **************************************/

void lcd1602_init(void)//液晶初始化函数
{ 
	u8 a;      
	wr=0;
	write_1602com(0x38);//设置液晶工作模式
	write_1602com(0x0c);//开显示不显示光标
	write_1602com(0x06);//整屏不移动，指针加一
	write_1602com(0x01);
	write_1602com(yh+2);//字符写入的位置
	for(a=0;a<14;a++)
	{
	write_1602dat(tab1[a]);
	//delay(3);
	}
	write_1602com(er+4);
	for(a=0;a<8;a++)
	{
	write_1602dat(tab2[a]);
	//delay(3);
	}

}


/******************液晶写入************************/
void write_1602com(u8 com)//液晶写入指令函数
{
	rs=0;//置为写入命令
	P0=com;//送入数据
	delay1Ms(1);
	en=1;//拉高使能端
	delay1Ms(1);
	en=0;//完成高脉冲
}


void write_1602dat(u8 dat)
{
	rs=1;//置为写入数据
	P0=dat;//送入数据
	delay1Ms(1);
	en=1;
	delay1Ms(1);
	en=0;
}


