/*
 *****************************************************************************************
 *	文 件 名 称:timer.c
 *  创 建 平 台：Keil uVision4
 *	创 建 作 者：miki
 *  文 件 功 能：定时器初始化及其配置
 *  github 地 址：
 *	创 建 日 期：2017-11-18
 *****************************************************************************************
 */

/************************************* 包含头文件 ***************************************/
#include "timer.h"
#include "ds1302.h"

/************************************* 全局变量定义 **************************************/
u8 GlobalInterruptAdd;

/*
 *****************************************************************************************
 * 函数名称：timer0InterruptInit
 * 函数功能：定时器0及其中断初始化
 * 输入参数：无
 * 输出参数：无
 * 其他说明：无
 ******************************************************************************************
 */
void timer0InterruptInit(void)
{	
	TMOD = 0x11;
	TH0 = 0;
	TL0 = 0;
	EA = 1;
	ET0 = 1;
	TR0=1;
}

/*
 *****************************************************************************************
 * 函数名称：timer0InterruptHandler
 * 函数功能：定时器0中断服务函数
 * 输入参数：无
 * 输出参数：无
 * 其他说明：无
 ******************************************************************************************
 */
void timer0InterruptHandler() interrupt 1
{
	miao = BCD_Decimal(read_1302(0x81));
	fen = BCD_Decimal(read_1302(0x83));
	shi  = BCD_Decimal(read_1302(0x85));
	ri  = BCD_Decimal(read_1302(0x87));
	yue = BCD_Decimal(read_1302(0x89));
	nian=BCD_Decimal(read_1302(0x8d));
	week=BCD_Decimal(read_1302(0x8b));

	write_sfm(10,miao);
	write_sfm(7,fen);
	write_sfm(4,shi);
	
	write_nyr(10,ri);
    write_nyr(7,yue);

}

